tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf6393_tdd.h
#define SEG5COM3                      522
#define SEG6COM3                      523
#define S6C3                          524
#define S06C3                         525
#define SEG7COM3                      526
#define S7C3                          527
#define S07C3                         528
#define S8C3                          529
#define SEG8COM3                      530
#define S08C3                         531
#define LCDDATA19                     532
#define S9C3                          533
#define SEG9COM3                      534
#define S09C3                         535
#define SEG10COM3                     536
#define S10C3                         537
#define S11C3                         538
#define SEG11COM3                     539
#define S12C3                         540
#define T3CKPS019                     541
#define SEG12COM3                     542
#define S13C3                         543
#define SEG13COM3                     544
#define T3CKPS119                     545
#define S14C3                         546
#define SEG14COM3                     547
#define TMR3CS019                     548
#define SEG15COM3                     549
#define S15C3                         550
#define TMR3CS119                     551
#define LCDDATA20                     552
#define S16C3                         553
#define SEG16COM3                     554
#define SEG17COM3                     555
#define S17C3                         556
#define SEG18COM3                     557
#define S18C3                         558
#define S19C3                         559
#define SEG19COM3                     560
#define S20C3                         561
#define SEG20COM3                     562
#define SEG21COM3                     563
#define S21C3                         564
#define SEG22COM3                     565
#define S22C3                         566
#define S23C3                         567
#define SEG23COM3                     568
#define S24C3                         569
#define LCDDATA21                     570
#define SEG24COM3                     571
#define S25C3                         572
#define SEG25COM3                     573
#define S26C3                         574
#define SEG26COM3                     575
#define SEG27COM3                     576
#define S27C3                         577
#define SEG28COM3                     578
#define S28C3                         579
#define SEG29COM3                     580
#define S29C3                         581
#define SEG30COM3                     582
#define S30C3                         583
#define SEG31COM3                     584
#define S31C3                         585
#define LCDDATA22                     586
#define S32C3                         587
#define SEG32COM3                     588
#define SEG33COM3                     589
#define S33C3                         590
#define S34C3                         591
#define SEG34COM3                     592
#define S35C3                         593
#define SEG35COM3                     594
#define S36C3                         595
#define SEG36COM3                     596
#define SEG37COM3                     597
#define S37C3                         598
#define S38C3                         599
#define SEG38COM3                     600
#define SEG39COM3                     601
#define S39C3                         602
#define LCDDATA23                     603
#define S40C3                         604
#define SEG40COM3                     605
#define SEG41COM3                     606
#define S41C3                         607
#define S42C3                         608
#define SEG42COM3                     609
#define SEG43COM3                     610
#define S43C3                         611
#define SEG44COM3                     612
#define S44C3                         613
#define S45C3                         614
#define SEG45COM3                     615
#define S46C3                         616
#define SEG46COM3                     617
#define S47C3                         618
#define SEG47COM3                     619
#define BAUDCON1                      620
#define ABDEN1                        621
#define ABDEN                         622
#define WUE1                          623
#define WUE                           624
#define BRG16                         625
#define BRG161                        626
#define SCKP                          627
#define TXCKP                         628
#define SCKP1                         629
#define TXCKP1                        630
#define CKTXP                         631
#define RCMT                          632
#define RCIDL                         633
#define RCIDL1                        634
#define RCMT1                         635
#define ABDOVF                        636
#define ABDOVF1                       637
#define PORTA                         638
#define AN0                           639
#define ULPWUIN                       640
#define PORTA_RA0                     641
#define AN1                           642
#define PORTA_RA1                     643
#define SEG16                         644
#define AN2                           645
#define PORTA_RA2                     646
#define VREFM                         647
#define SEG17                         648
#define AN3                           649
#define PORTA_RA3                     650
#define VREFP                         651
#define PORTA_RA4                     652
#define SEG14                         653
#define T0CKI                         654
#define SEG15                         655
#define AN4                           656
#define PORTA_RA5                     657
#define LVDIN                         658
#define CLKO                          659
#define PORTA_RA6                     660
#define OSC2                          661
#define CLKI                          662
#define PORTA_RA7                     663
#define OSC1                          664
#define PORTA_RJPU                    665
#define PORTB                         666
#define INT0                          667
#define PORTB_RB0                     668
#define INT1                          669
#define SEG8                          670
#define PORTB_RB1                     671
#define INT2                          672
#define SEG9                          673
#define PORTB_RB2                     674
#define SEG10                         675
#define CCP2B                         676
#define INT3                          677
#define CCP2_PA2                      678
#define PORTB_RB3                     679
#define SEG11                         680
#define KBI0                          681
#define PORTB_RB4                     682
#define PGM                           683
#define KBI1                          684
#define PORTB_RB5                     685
#define PGC                           686
#define KBI2                          687
#define PORTB_RB6                     688
#define PGD                           689
#define KBI3                          690
#define PORTB_RB7                     691
#define PORTC                         692
#define T13CKI                        693
#define T1OSO                         694
#define PORTC_RC0                     695
#define CCP2C                         696
#define CCP2                          697
#define T1OSI                         698
#define PA2                           699
#define PORTC_RC1                     700
#define CCP1                          701
#define SEG13                         702
#define PA1                           703
#define PORTC_RC2                     704
#define SEG12                         705
#define SCL                           706
#define SCK                           707
#define PORTC_RC3                     708
#define SDA                           709
#define SDI                           710
#define PORTC_RC4                     711
#define SDO                           712
#define PORTC_RC5                     713
#define TX                            714
#define CK                            715
#define PORTC_RC6                     716
#define DT                            717
#define RX                            718
#define PORTC_RC7                     719
#define PORTD                         720
#define SEG0                          721
#define PORTD_RD0                     722
#define PORTD_RD1                     723
#define SEG1                          724
#define PORTD_RD2                     725
#define SEG2                          726
#define PORTD_RD3                     727
#define SEG3                          728
#define SEG4                          729
#define PORTD_RD4                     730
#define SEG5                          731
#define PORTD_RD5                     732
#define SEG6                          733
#define PORTD_RD6                     734
#define PORTD_RD7                     735
#define SEG7                          736
#define SS2                           737
#define PORTE                         738
#define PD2                           739
#define RDE                           740
#define LCDBIAS1                      741
#define RE0                           742
#define BIAS1                         743
#define WRE                           744
#define LCDBIAS2                      745
#define PC2                           746
#define RE1                           747
#define BIAS2                         748
#define PORTE_CS                      749
#define CCP10                         750
#define PB2                           751
#define RE2                           752
#define LCDBIAS3                      753
#define BIAS3                         754
#define COM0                          755
#define CCP9E                         756
#define RE3                           757
#define PC3E                          758
#define PB3E                          759
#define COM1                          760
#define PORTE_RE4                     761
#define CCP8E                         762
#define COM2                          763
#define CCP7E                         764
#define PORTE_RE5                     765
#define PC1E                          766
#define CCP6E                         767
#define COM3                          768
#define PORTE_RE6                     769
#define PB1E                          770
#define CCP2E                         771
#define SEG31                         772
#define PA2E                          773
#define PORTE_RE7                     774
#define PORTF                         775
#define PORTF_RF0                     776
#define SEG18                         777
#define AN5                           778
#define PORTF_RF1                     779
#define SEG19                         780
#define C2OUTF                        781
#define AN6                           782
#define PORTF_RF2                     783
#define AN7                           784
#define SEG20                         785
#define C1OUTF                        786
#define PORTF_RF3                     787
#define AN8                           788
#define SEG21                         789
#define AN9                           790
#define PORTF_RF4                     791
#define SEG22                         792
#define PORTF_RF5                     793
#define SEG23                         794
#define AN10                          795
#define CVREFF                        796
#define PORTF_RF6                     797
#define SEG24                         798
#define AN11                          799
#define PORTF_RF7                     800
#define SEG25                         801
#define SS                            802
#define PORTG                         803
#define SEG30                         804
#define PORTG_RG0                     805
#define C3OUTG                        806
#define SEG29                         807
#define TX2                           808
#define PORTG_RG1                     809
#define CK2                           810
#define RX2                           811
#define SEG28                         812
#define PORTG_RG2                     813
#define DT2                           814
#define SEG27                         815
#define PORTG_RG3                     816
#define SEG26                         817
#define PORTG_RG4                     818
#define VPP                           819
#define PORTG_RJPU                    820
#define RG5                           821
#define MCLR                          822
#define LATA                          823
#define LATA0                         824
#define LA0                           825
#define LATA1                         826
#define LA1                           827
#define LATA2                         828
#define LA2                           829
#define LATA3                         830
#define LA3                           831
#define LATA4                         832
#define LA4                           833
#define LATA5                         834
#define LA5                           835
#define LATA6                         836
#define LA6                           837
#define LATA7                         838
#define LA7                           839
#define LATB                          840
#define LB0                           841
#define LATB0                         842
#define LB1                           843
#define LATB1                         844
#define LB2                           845
#define LATB2                         846
#define LB3                           847
#define LATB3                         848
#define LB4                           849
#define LATB4                         850
#define LB5                           851
#define LATB5                         852
#define LB6                           853
#define LATB6                         854
#define LB7                           855
#define LATB7                         856
#define LATC                          857
#define LATC0                         858
#define LC0                           859
#define LATC1                         860
#define LC1                           861
#define LATC2                         862
#define LC2                           863
#define LATC3                         864
#define LC3                           865
#define LATC4                         866
#define LC4                           867
#define LATC5                         868
#define LC5                           869
#define LATC6                         870
#define LC6                           871
#define LATC7                         872
#define LC7                           873
#define LATD                          874
#define LATD0                         875
#define LD0                           876
#define LATD1                         877
#define LD1                           878
#define LATD2                         879
#define LD2                           880
#define LATD3                         881
#define LD3                           882
#define LATD4                         883
#define LD4                           884
#define LATD5                         885
#define LD5                           886
#define LATD6                         887
#define LD6                           888
#define LATD7                         889
#define LD7                           890
#define LATE                          891
#define LATE4                         892
#define LE4                           893
#define LATE5                         894
#define LE5                           895
#define LATE6                         896
#define LE6                           897
#define LATE7                         898
#define LE7                           899
#define LATF                          900
#define LATF0                         901
#define LF0                           902
#define LATF1                         903
#define LF1                           904
#define LF2                           905
#define LATF2                         906
#define LF3                           907
#define LATF3                         908
#define LF4                           909
#define LATF4                         910
#define LF5                           911
#define LATF5                         912
#define LF6                           913
#define LATF6                         914
#define LF7                           915
#define LATF7                         916
#define LATG                          917
#define LATG0                         918
#define LG0                           919
#define LATG1                         920
#define LG1                           921
#define LATG2                         922
#define LG2                           923
#define LATG3                         924
#define LG3                           925
#define LATG4                         926
#define LG4                           927
#define TRISA                         928
#define TRISA0                        929
#define TRISA_RA0                     930
#define TRISA1                        931
#define TRISA_RA1                     932
#define TRISA2                        933
#define TRISA_RA2                     934
#define TRISA3                        935
#define TRISA_RA3                     936
#define TRISA_RA4                     937
#define TRISA4                        938
#define TRISA_RA5                     939
#define TRISA5                        940
#define TRISA_RA6                     941
#define TRISA6                        942
#define TRISA_RA7                     943
#define TRISA7                        944
#define TRISB                         945
#define TRISB_RB0                     946
#define TRISB0                        947
#define TRISB_RB1                     948
#define TRISB1                        949
#define TRISB_RB2                     950
#define TRISB2                        951
#define TRISB_RB3                     952
#define TRISB3                        953
#define TRISB_RB4                     954
#define TRISB4                        955
#define TRISB_RB5                     956
#define TRISB5                        957
#define TRISB_RB6                     958
#define TRISB6                        959
#define TRISB_RB7                     960
#define TRISB7                        961
#define TRISC                         962
#define TRISC0                        963
#define TRISC_RC0                     964
#define TRISC1                        965
#define TRISC_RC1                     966
#define TRISC2                        967
#define TRISC_RC2                     968
#define TRISC3                        969
#define TRISC_RC3                     970
#define TRISC4                        971
#define TRISC_RC4                     972
#define TRISC5                        973
#define TRISC_RC5                     974
#define TRISC6                        975
#define TRISC_RC6                     976
#define TRISC7                        977
#define TRISC_RC7                     978
#define TRISD                         979
#define TRISD_RD0                     980
#define TRISD0                        981
#define TRISD_RD1                     982
#define TRISD1                        983
#define TRISD_RD2                     984
#define TRISD2                        985
#define TRISD_RD3                     986
#define TRISD3                        987
#define TRISD_RD4                     988
#define TRISD4                        989
#define TRISD_RD5                     990
#define TRISD5                        991
#define TRISD_RD6                     992
#define TRISD6                        993
#define TRISD_RD7                     994
#define TRISD7                        995
#define TRISE                         996
#define TRISE_RE4                     997
#define TRISE4                        998
#define TRISE_RE5                     999
#define TRISE5                        1000
#define TRISE_RE6                     1001
#define TRISE6                        1002
#define TRISE_RE7                     1003
#define TRISE7                        1004
#define TRISF                         1005
#define TRISF0                        1006
#define TRISF_RF0                     1007
#define TRISF_RF1                     1008
#define TRISF1                        1009
#define TRISF_RF2                     1010
#define TRISF2                        1011
#define TRISF3                        1012
#define TRISF_RF3                     1013
#define TRISF_RF4                     1014
#define TRISF4                        1015
#define TRISF_RF5                     1016
#define TRISF5                        1017
#define TRISF_RF6                     1018
#define TRISF6                        1019
#define TRISF7                        1020
#define TRISF_RF7                     1021
#define TRISG                         1022
#define TRISG0                        1023
#define TRISG_RG0                     1024
#define TRISG1                        1025
#define TRISG_RG1                     1026
#define TRISG2                        1027
#define TRISG_RG2                     1028
#define TRISG_RG3                     1029
#define TRISG3                        1030
#define TRISG4                        1031
#define TRISG_RG4                     1032
#define OSCTUNE                       1033
#define TUN0                          1034
#define TUN                           1035
#define TUN1                          1036
#define TUN2                          1037
#define TUN3                          1038
#define TUN4                          1039
#define PLLEN                         1040
#define INTSRC                        1041
#define PIE1                          1042
#define TMR1IE                        1043
#define TMR2IE                        1044
#define CCP1IE                        1045
#define SSPIE                         1046
#define TXIE                          1047
#define TX1IE                         1048
#define RCIE                          1049
#define RC1IE                         1050
#define ADIE                          1051
#define PIR1                          1052
#define TMR1IF                        1053
#define TMR2IF                        1054
#define CCP1IF                        1055
#define SSPIF                         1056
#define TXIF                          1057
#define TX1IF                         1058
#define RCIF                          1059
#define RC1IF                         1060
#define ADIF                          1061
#define IPR1                          1062
#define TMR1IP                        1063
#define TMR2IP                        1064
#define CCP1IP                        1065
#define SSPIP                         1066
#define TX1IP                         1067
#define TXIP                          1068
#define RC1IP                         1069
#define RCIP                          1070
#define ADIP                          1071
#define PIE2                          1072
#define CCP2IE                        1073
#define TMR3IE                        1074
#define HLVDIE                        1075
#define LVDIE                         1076
#define BCLIE                         1077
#define CMIE                          1078
#define OSCFIE                        1079
#define PIR2                          1080
#define CCP2IF                        1081
#define TMR3IF                        1082
#define HLVDIF                        1083
#define LVDIF                         1084
#define BCLIF                         1085
#define CMIF                          1086
#define OSCFIF                        1087
#define IPR2                          1088
#define CCP2IP                        1089
#define TMR3IP                        1090
